## My Public Brewfile. Minimal casks, no mas apps.

tap "bramstein/webfonttools"
tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"

brew "ack"                                # Search tool like grep, but optimized for programmers
brew "adwaita-icon-theme"                 # Icons for the GNOME project
brew "aom"                                # Codec library for encoding and decoding AV1 video streams
brew "asciiquarium"                       # Aquarium animation in ASCII art
brew "autoconf"                           # Automatic configure script builder
brew "automake"                           # Tool for generating GNU Standards-compliant Makefiles

brew "bash"                               # Bourne-Again SHell, a UNIX command interpreter (macOS's version of Bash is old)
brew "bash-completion@2"                  # Programmable completion for Bash 4.2+
brew "bat"                                # Clone of cat with syntax highlighting and Git integration
brew "binutils"                           # GNU binary tools for native development

brew "cask"                               # Emacs dependency management
brew "cmake"                              # Cross-platform make
brew "coreutils"                          # GNU File, Shell, and Text utilities
brew "cowsay"                             # Configurable talking characters in ASCII art
brew "curl"                               # Get a file from an HTTP, HTTPS or FTP server

brew "diffutils"                          # File comparison utilities
brew "docutils"                           # Text processing system for reStructuredText
brew "duf"                                # Disk Usage/Free Utility - a better 'df' alternative

brew "exa"                                # Modern replacement for 'ls'

brew "fd"                                 # Simple, fast and user-friendly alternative to find
brew "figlet"                             # Banner-like program prints strings as ASCII art
brew "findutils"                          # Collection of GNU find, xargs, and locate
brew "fortune"                            # Infamous electronic fortune-cookie generator
brew "futhark"                            # Data-parallel functional programming language

brew "gawk"                               # GNU awk utility
brew "gh"                                 # GitHub command-line tool
brew "git-extras"                         # Small git utilities
brew "gitmoji"                            # Interactive command-line tool for using emoji in commit messages
brew "glances"                            # Utility to provide quick look previews for files that aren't natively supported
brew "glib"                               # Core application library for C
brew "gobject-introspection"              # Generate introspection data for GObject libraries
brew "gnu-indent"                         # C code prettifier
brew "gnupg", link: false                 # GNU Pretty Good Privacy (PGP) package
brew "gnu-sed"                            # GNU implementation of the famous stream editor
brew "gnu-tar"                            # GNU version of the tar archiving utility
brew "gnu-which"                          # GNU implementation of which utility
brew "grep"                               # GNU grep, egrep and fgrep
brew "gtop"								                # System monitoring dashboard for terminal
brew "gzip"                               # Popular GNU data compression program

brew "harfbuzz"                           # OpenType text shaping engine
brew "howdoi"                             # Instant coding answers via the command-line
brew "htop"                               # Improved top (interactive process viewer)

brew "iftop"                              # Display an interface's bandwidth usage

brew "legit"                              # Command-line interface for Git, optimized for workflow simplicity
brew "less"                               # Pager program similar to more
brew "libconfig"                          # Configuration file processing library
brew "lolcat"                             # Rainbows and unicorns in your console!
brew "lsd"                                # Clone of ls with colorful output, file type icons, and more
brew "lua"                                # Powerful, lightweight programming language
brew "lynis"                              # Security and system auditing tool to harden systems

brew "make"                               # Utility for directing compilation
brew "mas"                                # Mac App Store command-line interface
brew "micro"                              # Modern and intuitive terminal-based text editor
brew "moreutils"                          # Collection of tools that nobody wrote when UNIX was young
brew "most"                               # Powerful paging program

brew "nano"                               # Free (GNU) replacement for the Pico text editor
brew "ncdu"                               # NCurses Disk Usage
brew "neofetch"                           # Fast, highly customisable system info script
brew "nghttp2"                            # HTTP/2 C Library
brew "nmap"                               # Port scanning utility for large networks
brew "node"                               # Platform built on V8 to build network applications

brew "openssl@3"                          # Also known as: openssl. Cryptography and SSL/TLS Toolkit

brew "pango"                              # Framework for layout and rendering of i18n text
brew "pcre2"                              # Perl compatible regular expressions library with a new API
brew "php", restart_service: true         # General-purpose scripting language
brew "pinentry-mac"                       # Pinentry for GPG on Mac

brew "rsync"                              # Utility that provides fast incremental file transfer

brew "screen"                             # Terminal multiplexer with VT100/ANSI terminal emulation
brew "shellcheck"                         # Static analysis and lint tool, for (ba)sh scripts
brew "sl"                                 # Prints a steam locomotive if you type sl instead of ls
brew "smartmontools"                      # SMART hard drive monitoring
brew "speedtest-cli"                      # Command-line interface for https://speedtest.net bandwidth tests

brew "tldr"                               # Simplified and community-driven man pages
brew "tree"                               # Display directories as trees (with optional color/HTML output)

brew "vim"                                # Vi 'workalike' with many additional features

brew "watch"                              # Executes a program periodically, showing output fullscreen
brew "watchman"                           # Watch files and take action when they change
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "wdiff"                              # Display word differences between text files
brew "wget"                               # Internet file retriever

cask "adapter"                            # Converts Video, Audio and Images
cask "atom"                               # "A hackable text editor for the 21st Century"
cask "bitwarden"                          # Desktop password and login vault
cask "dozer"                              # Tool to hide status bar icons
cask "dropbox"                            # Client for the Dropbox cloud storage service
cask "eloston-chromium"                   # Google Chromium, sans integration with Google
cask "firefox"                            # Web browser
cask "handbrake"                          # Open-source video transcoder
cask "hyper"                              # Terminal built on web technologies
cask "iterm2"                             # Terminal emulator as alternative to Apple's Terminal app
cask "keyboard-cleaner"                   # Desktop shield and keystroke interceptor
cask "macfuse"                            # File system integration: allows you to extend macOS's native file handling capabilities via third-party file systems
cask "mactex"                             # Full TeX Live distribution with GUI applications
cask "raspberry-pi-imager"                # Imaging utility to install operating systems to a microSD card
cask "timemachineeditor"                  # Utility to change the default backup interval of Time Machine
cask "veracrypt"                          # Disk encryption software focusing on security based on TrueCrypt
cask "vlc"                                # Multimedia player
cask "zoom"                               # Video communication and virtual meeting platform
