## My Public Brewfile. No casks, no mas.

tap "bramstein/webfonttools"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "ack"                                # Search tool like grep, but optimized for programmers
brew "glib"                               # Core application library for C
brew "gobject-introspection"              # Generate introspection data for GObject libraries
brew "harfbuzz"                           # OpenType text shaping engine
brew "pango"                              # Framework for layout and rendering of i18n text
brew "adwaita-icon-theme"                 # Icons for the GNOME project
brew "aom"                                # Codec library for encoding and decoding AV1 video streams
brew "aria2"                              # Download with resuming and segmented downloading (ex. 'aria2c http://example.org/mylinux.iso')
brew "asciiquarium"                       # Aquarium animation in ASCII art
brew "autoconf"                           # Automatic configure script builder
brew "automake"                           # Tool for generating GNU Standards-compliant Makefiles
brew "bash"                               # Bourne-Again SHell, a UNIX command interpreter (macOS's version of Bash is old)
brew "bash-completion@2"                  # Programmable completion for Bash 4.2+
brew "binutils"                           # GNU binary tools for native development
brew "coreutils"                          # GNU File, Shell, and Text utilities
brew "emacs", restart_service: true, link: false
brew "cask"                               # Emacs dependency management
brew "cmake"                              # Cross-platform make
brew "cowsay"                             # Configurable talking characters in ASCII art
brew "curl"                               # Get a file from an HTTP, HTTPS or FTP server
brew "diffutils"                          # File comparison utilities
brew "docutils"                           # Text processing system for reStructuredText
brew "duf"                                # Disk Usage/Free Utility - a better 'df' alternative
brew "ed"                                 # Classic UNIX line editor
brew "exa"                                # Modern replacement for 'ls'
brew "fd"                                 # Simple, fast and user-friendly alternative to find
brew "figlet"                             # Banner-like program prints strings as ASCII art
brew "findutils"                          # Collection of GNU find, xargs, and locate
brew "fortune"                            # Infamous electronic fortune-cookie generator
brew "futhark"                            # Data-parallel functional programming language
brew "gawk"                               # GNU awk utility
brew "gh"                                 # GitHub command-line tool
brew "git-extras"                         # Small git utilities
brew "node"                               # Platform built on V8 to build network applications
brew "gitmoji"                            # Interactive command-line tool for using emoji in commit messages
brew "glances"                            # Utility to provide quick look previews for files that aren't natively supported
brew "gnu-indent"                         # C code prettifier
brew "gnu-sed"                            # GNU implementation of the famous stream editor
brew "gnu-tar"                            # GNU version of the tar archiving utility
brew "gnu-which"                          # GNU implementation of which utility
brew "gnupg", link: false                 # GNU Pretty Good Privacy (PGP) package
brew "grep"                               # GNU grep, egrep and fgrep
brew "gtop"								  # System monitoring dashboard for terminal
brew "gzip"                               # Popular GNU data compression program
brew "htop"                               # Improved top (interactive process viewer)
brew "iftop"                              # Display an interface's bandwidth usage
brew "legit"                              # Command-line interface for Git, optimized for workflow simplicity
brew "libconfig"                          # Configuration file processing library
brew "lolcat"                             # Rainbows and unicorns in your console!
brew "lsd"                                # Clone of ls with colorful output, file type icons, and more
brew "lua"                                # Powerful, lightweight programming language
brew "lynis"                              # Security and system auditing tool to harden systems
brew "mackup"                             # Keep your Mac's application settings in sync
brew "mas"                                # Mac App Store command-line interface
brew "micro"                              # Modern and intuitive terminal-based text editor
brew "moreutils"                          # Collection of tools that nobody wrote when UNIX was young
brew "most"                               # Powerful paging program
brew "nano"                               # Free (GNU) replacement for the Pico text editor
brew "ncdu"                               # NCurses Disk Usage
brew "neofetch"                           # Fast, highly customisable system info script
brew "nghttp2"                            # HTTP/2 C Library
brew "nmap"                               # Port scanning utility for large networks
brew "openssl@3"                          # Cryptography and SSL/TLS Toolkit
brew "pcre2"                              # Perl compatible regular expressions library with a new API
brew "php", restart_service: true         # General-purpose scripting language
brew "pinentry-mac"                       # Pinentry for GPG on Mac
brew "pipes-sh"                           # Animated pipes terminal screensaver
brew "postgresql", restart_service: true  # Object-relational database system
brew "redis", restart_service: true       # Persistent key-value database, with built-in net interface
brew "ripgrep"                            # Search tool like grep and The Silver Searcher
brew "rsync"                              # Utility that provides fast incremental file transfer
brew "screen"                             # Terminal multiplexer with VT100/ANSI terminal emulation
brew "shellcheck"                         # Static analysis and lint tool, for (ba)sh scripts
brew "sl"                                 # Prints a steam locomotive if you type sl instead of ls
brew "smartmontools"                      # SMART hard drive monitoring
brew "speedtest-cli"                      # Command-line interface for https://speedtest.net bandwidth tests
brew "tldr"                               # Simplified and community-driven man pages
brew "tmux"                               # Terminal multiplexer
brew "tmux-xpanes"                        # Ultimate terminal divider powered by tmux
brew "trash"                              # CLI tool that moves files or folder to the trash
brew "tree"                               # Display directories as trees (with optional color/HTML output)
brew "vim"                                # Vi 'workalike' with many additional features
brew "watch"                              # Executes a program periodically, showing output fullscreen
brew "watchman"                           # Watch files and take action when they change
brew "wdiff"                              # Display word differences between text files
brew "wget"                               # Internet file retriever
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "clintmod/formulas/macprefs"         # A tool to backup and restore Mac preferences
